/*******************************************************************************  
文件名称： main.c 
作 者：    
版 本：    V1.00
说 明：    光耦隔离继电器控制实验
修改记录：  
**************************************************/
/************************************************
*Descriptoon:                                 
*          因51单片机驱动能力弱            
*          为了保护IO口                   
*          请加光耦隔离模块驱动            
*接线说明：P00-IN1，OUT1-RL1
**************************************************/
#include<reg52.h>
#include <intrins.h>

#define uchar unsigned char	 //数据类型宏定义
#define uint unsigned int
/**********引脚定义*******************************/
sbit RLY =  P0^0;
void delayms(uint ms)	
// 延时子程序
{						
	unsigned char i;
	while(ms--)
	{
		for(i = 0; i < 120; i++);
	}
}
/*********主函数**********************************/
void main(void)
{
	RLY = 1;
	while(1)
	{
		delayms(2000);	 //延时		
		RLY = ~RLY;		 //取反
		//delayms(2000);	
	}
}