/*************************************************************
*
*
*
*
 *************************************************************/
#include <reg51.h>
#include <stdio.h>
#define uchar unsigned char
#define uint unsigned int

sbit led=P2^0;		//位定义
sbit outside_int0=P3^2;
sbit outside_int1=P3^3;
/********************************************************************
* 名称 : Outside_Init0()
* 功能 : 外部中断0 的初始化
* 输入 : 无
* 输出 : 无
***********************************************************************/
void Outside_Init0(void)
{
	EX0 = 1;  //开外部中断0
	IT0 = 0;  //电平触发 
//	IT0 = 1;  //边沿触发
	EA = 1;	  //开总中断
}
/********************************************************************
* 名称 : Outside_Init1()
* 功能 : 外部中断1 的初始化
* 输入 : 无
* 输出 : 无
***********************************************************************/
void Outside_Init1(void)
{
	EX1 = 1;  //开外部中断0
//	IT1 = 0;  //电平触发 
	IT1 = 1;  //边沿触发
	EA = 1;	  //开总中断
}
//////////////主函数//////////////////////////
void main(void)
 { 
   Outside_Init0();
   Outside_Init1();
   while (1);  
 }
 /////////////外部中断函数0///////////////////////////
 void Outside_Int0(void) interrupt 0
 {
    EA=0;
    led=~led;
    while(!outside_int0);
    EA=1;
  }
  ///////////外部中断函数1/////////////////////
 void Outside_Int1(void) interrupt 2
 {
    EA=0;
    led=~led;
//    while(!outside_int1);
    EA=1;
  }