/*******************************************************************************     
文件名称： main.c 
作 者：    
版 本：    V1.00
说 明：    74LS165并入串出移位实验 
修改记录：  
-------------------------------------------------------------------------------- 
功能描述:                                                              
*          控制74LS165                                                                                          
*          实现并行数据输入,串行数据输出 
--------------------------------------------------------------------------------
*接线说明：P30-SO，P31-CP,P32-SH,P10~P17——D1~D8,SW1~SW8——QA~QH,                                   
*******************************************************************************/
#include <reg52.h>
#include <intrins.h>

#define uchar unsigned char
#define uint unsigned int

#define Dout P1

sbit SH=P3^2;
/*********主函数***************************************************************/
void main(void)
{
	SCON=0X10;		    //设定UART方式0,允许接收数据
	while(1)
	{
	 	SH=0;		   //载入数据
	 	_nop_();
		_nop_();
		_nop_();
	 	SH=1;          //数据输出
	 	RI=0;
	 	while(!RI);	   //判断是否接收完数据
	 	RI=0;
	 	Dout=SBUF;	   //输出接收到的数据
	}
}																					 